[
  {
    "id": 1,
    "title": "Lepak Kudenggeh",
    "description": "Summer naale namma yellarukkum niyabagam varadhu Veyil mattum-tha la. Apram Veyil-ah thandi vera ennada niyabagam varum indha season-la nu kekringla?. Namma yellarum school padikrapo Annual leave viduvanga we mean that \"Summer Holidays\". Appo andha Time-la naama Veyil-ah thaandi sila settaigal,sambhavangala pannirupom. Andha Memories-ah recollect pandrathukku-tha indha Episode. So Summer Holidays-ah pathi \"Ennena Solranga Parunga!\". Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "thumbnail": "https://i.scdn.co/image/ab67616d0000b27340dd41ad27cc4185f6631d62",
    "duration": "24:18"
  },
  {
    "id": 2,
    "title": "Angry Bird",
    "description": "Life-la Tour naale Namma yellarukkum oru nalla marakka mudiyatha Good Memories irukkum!. Athuvum Clg Friends-ooda pona tour-na sollava venum!. So Andha Maari Gopi pona oru Tour-la ulla Fun, Comedy, Galatta's matrum sila Sambhavangala pathi Indha episode-la Ennena Solranga Parunga!. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "thumbnail": "https://i.scdn.co/image/ab67616d0000b27340dd41ad27cc4185f6631d62",
    "duration": "18:42"
  },
  {
    "id": 3,
    "title": "Nanben Daa",
    "description": "Gopi Sudhakar-ooda Combo Namakku yevlo pidikkum, Apdi patta oru Combo Enga Start aachunu Therinjukanuma?, Appo udane indha Episode-ah kelunga Makkale!. Indha Episode-la avanga Rendu Perum First Time-ah enga meet pannikitangandratha pathi \"Ennena Solranga Parunga!\".",
    "thumbnail": "https://i.scdn.co/image/ab67616d0000b27340dd41ad27cc4185f6631d62",
    "duration": "21:05"
  },
  {
    "id": 4,
    "title": "Pirantha Naal",
    "description": "Gopi-yum Sudhakar-um avanga First Year College Life-la nadantha Sila Vishayangala, matrum Pala Sambavangala Pathi indha Episode-la \"Ennena Solranga Parunga\" Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "thumbnail": "https://i.scdn.co/image/ab67616d0000b27340dd41ad27cc4185f6631d62",
    "duration": "19:11"
  },
  {
    "id": 5,
    "title": "Cintaku Buta 1.0",
    "description": "Maanavargale! Public Examai Kandu Bayama! Appo Udane indha Episode-ah Kelunga, idhula Gopi Avaru Public Exam Yeluthumbodhu irundha Bayatha!",
    "thumbnail": "https://i.scdn.co/image/ab67616d0000b27340dd41ad27cc4185f6631d62",
    "duration": "16:27"
  }
]
