[
  {
    "id":1,
    "author": "Tim cook",
    "title":"Microbiology",
    "date":"4d ago",
    "image":"https://static.testpress.in/static/img/default_medium_image.png",
    "category": "UPSC Updates",
    "number_of_comments":3,
    "text":"Embarking on a microscopic journey, microbiology unveils the hidden world of tiny organisms that shape life on Earth. From unraveling infectious diseases to harnessing microbial power in various industries, this scientific field plays a pivotal role in understanding the intricate relationships between microorganisms and their environments. Join the discussion as we explore the fascinating complexities of microbiology and its profound impact on health, industry, and the natural world."
  },
  {
    "id":2,
    "author": "Emily Selman",
    "title":"Ancient History",
    "date":"2d ago",
    "warning":"This comment is not yet visible to other users, because it is awaiting moderation by the administrator.",
    "image":"https://images.unsplash.com/photo-1517365830460-955ce3ccd263?ixlib=rb-=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=8&w=256&h=256&q=80",
    "category": "KPSC Updates",
    "number_of_comments":1,
    "text":"Tracing the Footsteps of Ages: A Glimpse into Ancient History's Rich Tapestry. From the rise and fall of empires to the evolution of civilizations, delve into the captivating narratives that have shaped our world. Unearth the secrets of bygone eras and unravel the timeless stories etched in the annals of ancient history."
  },
  {
    "id":3,
    "author": "Jackson",
    "title":"Political Science",
    "date":"an hour ago",
    "category": "UPSC Updates",
    "image":"https://static.testpress.in/static/img/default_medium_image.png",
    "number_of_comments":5,
    "text":"Exploring the Dynamics of Political Science. Navigate through the complexities of governance, international relations, and policy-making as we delve into the heart of political science. From the structures of power to the study of ideologies, embark on a journey that unravels the intricacies of shaping societies and global affairs."
  },
  {
    "id":4,
    "author": "Anil",
    "title":"IPR",
    "date":"3d ago",
    "category": "KPSC Updates",
    "image":"https://images.unsplash.com/photo-1519244703995-f4e0f30006d5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=2&w=256&h=256&q=80",
    "number_of_comments":12,
    "text":"Navigating the Landscape of Intellectual Property Rights. Explore the intersection of innovation and legal protection, delving into the world of patents, trademarks, and copyrights. Uncover the crucial role of intellectual property in fostering creativity, innovation, and the dynamic balance between rights and public interest."
  },
  {
    "id":5,
    "author": "Vimal",
    "title":"Bacteriology",
    "date":"5d ago",
    "category": "KPSC Updates",
    "image":"https://static.testpress.in/static/img/default_medium_image.png",
    "number_of_comments":6,
    "text":"Journey into the intricate realm of bacteria, from understanding their role in health and disease to exploring groundbreaking research in microbial ecosystems. Dive deep into the fascinating world of bacteriology, where tiny organisms hold significant implications for medicine, ecology, and biotechnology."
  }
]