[
  {
    "name": "Live Stream",
    "statuses": [
      {
        "name": "Not Started",
        "key": "not_started",
        "description": "Enable this to receive notifications when the live stream is created and ready to start."
      },
      {
        "name": "Streaming",
        "key": "streaming",
        "description": "Enable this to receive notifications when the live stream is live."
      },
      {
        "name": "Disconnected",
        "key": "disconnected",
        "description": "Enable this to receive notifications when the live stream disconnects unexpectedly."
      },
      {
        "name": "Stopped",
        "key": "stopped",
        "description": "Enable this to receive notifications when the live stream is intentionally stopped."
      },
      {
        "name": "Recording",
        "key": "recording",
        "description": "Enable this to receive notifications when the live stream recording begins."
      },
      {
        "name": "Completed",
        "key": "completed",
        "description": "Enable this to receive notifications when the live stream and recording fully complete."
      }
    ]
  },
  {
    "name": "Video",
    "statuses": [
      {
        "name": "Uploading",
        "key": "uploading",
        "description": "Enable this to receive notifications when a video upload starts."
      },
      {
        "name": "Transcoding",
        "key": "transcoding",
        "description": "Enable this to receive notifications when the video is being processed for playback."
      },
      {
        "name": "Completed",
        "key": "completed",
        "description": "Enable this to receive notifications when the video processing finishes successfully."
      },
      {
        "name": "Error",
        "key": "error",
        "description": "Enable this to receive notifications when the video upload or processing fails."
      }
    ]
  },
  {
    "name": "Video Trimming",
    "statuses": [
      {
        "name": "Completed",
        "key": "completed",
        "description": "Enable this to receive notifications when the video trimming task completes."
      }
    ]
  },
  {
    "name": "Transcoding",
    "statuses": [
      {
        "name": "Queued",
        "key": "queued",
        "description": "Enable this to receive notifications when a transcoding job enters the queue."
      },
      {
        "name": "Transcoding",
        "key": "transcoding",
        "description": "Enable this to receive notifications when a transcoding job starts processing."
      },
      {
        "name": "Completed",
        "key": "completed",
        "description": "Enable this to receive notifications when a transcoding job completes successfully."
      },
      {
        "name": "Error",
        "key": "error",
        "description": "Enable this to receive notifications when a transcoding job encounters an error."
      }
    ]
  }
]
